# **Creating your own data**

In [39]:
import pandas as pd

In [40]:
S = pd.Series(["Banana",5])
print(S)

0    Banana
1         5
dtype: object

In [41]:
A  = pd.Series(["Wes McKinney","Creator of Pandas"],index=['Person','Who'])
print(A)

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [42]:
scientits = {"Name" : ["Alan Turing", "William Gosset"],
             "Occupation" : ["Mathematician","Statistician"],
             "Born": ["23-06-1912","13-06-1876"],
             "Died" :["07-06-1954","16-10-1937"],
             "Age":[42,61]}

scientits

{'Name': ['Alan Turing', 'William Gosset'],
 'Occupation': ['Mathematician', 'Statistician'],
 'Born': ['23-06-1912', '13-06-1876'],
 'Died': ['07-06-1954', '16-10-1937'],
 'Age': [42, 61]}

In [43]:
p = pd.DataFrame(scientits,
             index=["one","two"])
p

,Name,Occupation,Born,Died,Age
one,Alan Turing,Mathematician,23-06-1912,07-06-1954,42
two,William Gosset,Statistician,13-06-1876,16-10-1937,61

In [44]:
first_row = p.loc['one']
print(first_row)

Name            Alan Turing
Occupation    Mathematician
Born             23-06-1912
Died             07-06-1954
Age                      42
Name: one, dtype: object

In [45]:
print(type(first_row))

<class 'pandas.core.series.Series'>

In [46]:
first_row.index

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [47]:
first_row.values

In [48]:
first_row.index

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [49]:
first_row.keys()

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [50]:
first_row.index[0]

'Name'

In [51]:
first_row.keys()[0]

'Name'

In [52]:
Ages = p["Age"]
Ages

In [53]:
Ages.mean()

51.5

In [54]:
Ages.min()

42

In [55]:
Ages.max()

61

In [56]:
Ages.std()

13.435028842544403

In [4]:
import pandas as pd
scientits = pd.read_csv("https://raw.githubusercontent.com/chendaniely/pandas_for_everyone/master/data/scientists.csv", sep = ',')

In [5]:
scientits

,Name,Born,Died,Age,Occupation
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist
1,William Gosset,1876-06-13,1937-10-16,61,Statistician
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist
5,John Snow,1813-03-15,1858-06-16,45,Physician
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician

In [6]:
ages = scientits.loc[:,'Age']

In [7]:
print(ages)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [8]:
print(ages.describe())

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [9]:
ages[ages>ages.mean()]

In [10]:
scientits.groupby('Occupation')['Name'].nunique(
                                                
)

In [11]:
ages>ages.mean()

In [12]:
ages[ages<ages.mean()]

In [13]:
boolean_values = [False, True, False, False, True, True, False, True]

In [14]:
ages[boolean_values]

# **Element - by - Element**

In [15]:
print(ages * ages)

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [16]:
ages

In [17]:
ages + pd.Series([1, 100])

In [18]:
import numpy as np

In [48]:
ages * np.array([1, 100])

ValueError: ValueError: operands could not be broadcast together with shapes (8,) (2,)

In [49]:
rev_ages = ages.sort_index(ascending=False)
rev_ages

In [50]:
ages

In [51]:
ages + rev_ages

In [52]:
scientits[scientits.loc[:,'Age']>scientits.loc[:,'Age'].mean()]

,Name,Born,Died,Age,Occupation
1,William Gosset,1876-06-13,1937-10-16,61,Statistician
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician

In [53]:
scientist= scientits.copy()

In [54]:
scientist

,Name,Born,Died,Age,Occupation
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist
1,William Gosset,1876-06-13,1937-10-16,61,Statistician
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist
5,John Snow,1813-03-15,1858-06-16,45,Physician
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician

In [55]:
first_half = scientist[:4]
print(first_half)

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [56]:
second_half = scientist[4:]
print(second_half)

            Name        Born        Died  Age          Occupation
4  Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5      John Snow  1813-03-15  1858-06-16   45           Physician
6    Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7   Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [57]:
print(scientist * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

In [58]:
print(scientist['Died'].dtype)

object

In [59]:
scientist['Born']

In [60]:
born_dates = pd.to_datetime(scientist['Born'],format = '%Y-%m-%d')
print(born_dates)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [61]:
died_dates = pd.to_datetime(scientist['Died'],format = '%Y-%m-%d')
print(died_dates)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [62]:
scientist['Born_dt'], scientist['Died_dt'] = (born_dates, died_dates)

In [63]:
scientist

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [64]:
import random

In [65]:
random.seed(424)
scientist['Age']

In [66]:
random.shuffle(scientist['Age'])

/opt/python/lib/python3.8/random.py:307: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

In [67]:
scientist['Age']

In [68]:
scientist['Age'] = scientist['Age'].sample(len(scientist['Age']),random_state = 31)

In [69]:
scientist['Age']

In [70]:
scientist['age_days_dt'] = (scientist['Died_dt'] - scientist['Born_dt'])

In [71]:
scientist

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,37,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,61,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [72]:
scientist['age_years_dt'] = scientist['age_days_dt'].astype('timedelta64[Y]')

In [73]:
scientist

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt,age_years_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16,13779 days,37.0
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,1876-06-13,1937-10-16,22404 days,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days,90.0
3,Marie Curie,1867-11-07,1934-07-04,37,Chemist,1867-11-07,1934-07-04,24345 days,66.0
4,Rachel Carson,1907-05-27,1964-04-14,61,Biologist,1907-05-27,1964-04-14,20777 days,56.0
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days,45.0
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days,41.0
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days,77.0

In [74]:
scientist.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'Born_dt', 'Died_dt',
       'age_days_dt', 'age_years_dt'],
      dtype='object')

In [75]:
drop_columns = ['Born','Died','Age']

In [76]:
scientist = scientist.drop(columns=drop_columns)

In [77]:
scientist

,Name,Occupation,Born_dt,Died_dt,age_days_dt,age_years_dt
0,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,13779 days,37.0
1,William Gosset,Statistician,1876-06-13,1937-10-16,22404 days,61.0
2,Florence Nightingale,Nurse,1820-05-12,1910-08-13,32964 days,90.0
3,Marie Curie,Chemist,1867-11-07,1934-07-04,24345 days,66.0
4,Rachel Carson,Biologist,1907-05-27,1964-04-14,20777 days,56.0
5,John Snow,Physician,1813-03-15,1858-06-16,16529 days,45.0
6,Alan Turing,Computer Scientist,1912-06-23,1954-06-07,15324 days,41.0
7,Johann Gauss,Mathematician,1777-04-30,1855-02-23,28422 days,77.0

In [78]:
names = scientist['Name']

In [79]:
names

In [80]:
names.to_csv('scientists_names_series.csv',index=False)

In [81]:
names.to_csv('scientists_names_series.csv',sep='\t')

In [82]:
namesdf = names.to_frame()

In [83]:
import xlwt

In [84]:
import openpyxl

In [85]:
namesdf

,Name
0,Rosaline Franklin
1,William Gosset
2,Florence Nightingale
3,Marie Curie
4,Rachel Carson
5,John Snow
6,Alan Turing
7,Johann Gauss

In [88]:
namesdf.to_excel("namesdf.xlsx")

In [90]:
scientist.to_excel('scientist.xlsx',
                  sheet_name= 'scientist',
                  index=False)